In [14]:
from pyspark.sql import SparkSession

In [70]:
spark = SparkSession.builder.appName('Practice').getOrCreate()

In [71]:
df = spark.read.csv("C:/Users/Acer/Desktop/test 1.csv", header = True, inferSchema = True)

In [72]:
df.show()

+---------+----+----------+-------+
|     Name| Age|Experience| Salary|
+---------+----+----------+-------+
|    krish|  22|         5| 100000|
|     naik|  35|         6| 100006|
|    Nupur|  20|         5|     10|
|     Yash|  34|         6| 566463|
|   Shivam|  33|        34|5621238|
|Deekshith|  26|        23| 262666|
|   Rajesh|  32|         2|5565665|
|   Madan |  45|        32|2222222|
|  Kuldeep|  43|      NULL| 150000|
|    Geeta|NULL|        30| 150000|
|    Shyam|  80|        40|   NULL|
+---------+----+----------+-------+

## dropping the columns

In [73]:
type(df)

pyspark.sql.dataframe.DataFrame

In [74]:
df.drop('Experience').show()

+---------+----+-------+
|     Name| Age| Salary|
+---------+----+-------+
|    krish|  22| 100000|
|     naik|  35| 100006|
|    Nupur|  20|     10|
|     Yash|  34| 566463|
|   Shivam|  33|5621238|
|Deekshith|  26| 262666|
|   Rajesh|  32|5565665|
|   Madan |  45|2222222|
|  Kuldeep|  43| 150000|
|    Geeta|NULL| 150000|
|    Shyam|  80|   NULL|
+---------+----+-------+

In [75]:
df.show()      # did it not actually drop or do I have to save it in a variable

+---------+----+----------+-------+
|     Name| Age|Experience| Salary|
+---------+----+----------+-------+
|    krish|  22|         5| 100000|
|     naik|  35|         6| 100006|
|    Nupur|  20|         5|     10|
|     Yash|  34|         6| 566463|
|   Shivam|  33|        34|5621238|
|Deekshith|  26|        23| 262666|
|   Rajesh|  32|         2|5565665|
|   Madan |  45|        32|2222222|
|  Kuldeep|  43|      NULL| 150000|
|    Geeta|NULL|        30| 150000|
|    Shyam|  80|        40|   NULL|
+---------+----+----------+-------+

In [76]:
ds = df.drop('Experience')

In [77]:
ds.show()       # yeah

+---------+----+-------+
|     Name| Age| Salary|
+---------+----+-------+
|    krish|  22| 100000|
|     naik|  35| 100006|
|    Nupur|  20|     10|
|     Yash|  34| 566463|
|   Shivam|  33|5621238|
|Deekshith|  26| 262666|
|   Rajesh|  32|5565665|
|   Madan |  45|2222222|
|  Kuldeep|  43| 150000|
|    Geeta|NULL| 150000|
|    Shyam|  80|   NULL|
+---------+----+-------+

### dropping null values

In [78]:
ds = df.na.drop()

In [79]:
ds.show()        ## dropped all NA rows

+---------+---+----------+-------+
|     Name|Age|Experience| Salary|
+---------+---+----------+-------+
|    krish| 22|         5| 100000|
|     naik| 35|         6| 100006|
|    Nupur| 20|         5|     10|
|     Yash| 34|         6| 566463|
|   Shivam| 33|        34|5621238|
|Deekshith| 26|        23| 262666|
|   Rajesh| 32|         2|5565665|
|   Madan | 45|        32|2222222|
+---------+---+----------+-------+

In [80]:
ds = df.na.drop(how = 'all').show()     ### only drop completely empty rows

+---------+----+----------+-------+
|     Name| Age|Experience| Salary|
+---------+----+----------+-------+
|    krish|  22|         5| 100000|
|     naik|  35|         6| 100006|
|    Nupur|  20|         5|     10|
|     Yash|  34|         6| 566463|
|   Shivam|  33|        34|5621238|
|Deekshith|  26|        23| 262666|
|   Rajesh|  32|         2|5565665|
|   Madan |  45|        32|2222222|
|  Kuldeep|  43|      NULL| 150000|
|    Geeta|NULL|        30| 150000|
|    Shyam|  80|        40|   NULL|
+---------+----+----------+-------+

In [81]:
ds = df.na.drop(how = 'any').show()         ## drop entire rows

+---------+---+----------+-------+
|     Name|Age|Experience| Salary|
+---------+---+----------+-------+
|    krish| 22|         5| 100000|
|     naik| 35|         6| 100006|
|    Nupur| 20|         5|     10|
|     Yash| 34|         6| 566463|
|   Shivam| 33|        34|5621238|
|Deekshith| 26|        23| 262666|
|   Rajesh| 32|         2|5565665|
|   Madan | 45|        32|2222222|
+---------+---+----------+-------+

#### threshold

In [82]:
ds = df.na.drop(how = 'all', thresh = 2).show()              # at least 2 null values should be present

+---------+----+----------+-------+
|     Name| Age|Experience| Salary|
+---------+----+----------+-------+
|    krish|  22|         5| 100000|
|     naik|  35|         6| 100006|
|    Nupur|  20|         5|     10|
|     Yash|  34|         6| 566463|
|   Shivam|  33|        34|5621238|
|Deekshith|  26|        23| 262666|
|   Rajesh|  32|         2|5565665|
|   Madan |  45|        32|2222222|
|  Kuldeep|  43|      NULL| 150000|
|    Geeta|NULL|        30| 150000|
|    Shyam|  80|        40|   NULL|
+---------+----+----------+-------+

In [83]:
ds = df.na.drop(how = 'all', thresh = 4).show()

+---------+---+----------+-------+
|     Name|Age|Experience| Salary|
+---------+---+----------+-------+
|    krish| 22|         5| 100000|
|     naik| 35|         6| 100006|
|    Nupur| 20|         5|     10|
|     Yash| 34|         6| 566463|
|   Shivam| 33|        34|5621238|
|Deekshith| 26|        23| 262666|
|   Rajesh| 32|         2|5565665|
|   Madan | 45|        32|2222222|
+---------+---+----------+-------+

### Subset

In [84]:
ds = df.na.drop(how  = 'all', subset = ['Experience']).show()     # will drop na values only from experience column

+---------+----+----------+-------+
|     Name| Age|Experience| Salary|
+---------+----+----------+-------+
|    krish|  22|         5| 100000|
|     naik|  35|         6| 100006|
|    Nupur|  20|         5|     10|
|     Yash|  34|         6| 566463|
|   Shivam|  33|        34|5621238|
|Deekshith|  26|        23| 262666|
|   Rajesh|  32|         2|5565665|
|   Madan |  45|        32|2222222|
|    Geeta|NULL|        30| 150000|
|    Shyam|  80|        40|   NULL|
+---------+----+----------+-------+

### filling missing values

In [87]:
ds = df.na.fill('Missing Values').show()         #### this is supposed to replace the NULL with Missing Values  - but it is not

+---------+----+----------+-------+
|     Name| Age|Experience| Salary|
+---------+----+----------+-------+
|    krish|  22|         5| 100000|
|     naik|  35|         6| 100006|
|    Nupur|  20|         5|     10|
|     Yash|  34|         6| 566463|
|   Shivam|  33|        34|5621238|
|Deekshith|  26|        23| 262666|
|   Rajesh|  32|         2|5565665|
|   Madan |  45|        32|2222222|
|  Kuldeep|  43|      NULL| 150000|
|    Geeta|NULL|        30| 150000|
|    Shyam|  80|        40|   NULL|
+---------+----+----------+-------+

In [89]:
ds = df.na.fill('Missing Values', subset = ['Salary', 'Age'] ).show()

+---------+----+----------+-------+
|     Name| Age|Experience| Salary|
+---------+----+----------+-------+
|    krish|  22|         5| 100000|
|     naik|  35|         6| 100006|
|    Nupur|  20|         5|     10|
|     Yash|  34|         6| 566463|
|   Shivam|  33|        34|5621238|
|Deekshith|  26|        23| 262666|
|   Rajesh|  32|         2|5565665|
|   Madan |  45|        32|2222222|
|  Kuldeep|  43|      NULL| 150000|
|    Geeta|NULL|        30| 150000|
|    Shyam|  80|        40|   NULL|
+---------+----+----------+-------+

In [90]:
df.show()

+---------+----+----------+-------+
|     Name| Age|Experience| Salary|
+---------+----+----------+-------+
|    krish|  22|         5| 100000|
|     naik|  35|         6| 100006|
|    Nupur|  20|         5|     10|
|     Yash|  34|         6| 566463|
|   Shivam|  33|        34|5621238|
|Deekshith|  26|        23| 262666|
|   Rajesh|  32|         2|5565665|
|   Madan |  45|        32|2222222|
|  Kuldeep|  43|      NULL| 150000|
|    Geeta|NULL|        30| 150000|
|    Shyam|  80|        40|   NULL|
+---------+----+----------+-------+

## Imputing missing values

In [93]:
from pyspark.ml.feature import Imputer               ####  just remember this code

imp = Imputer( inputCols = ['Age', 'Experience', 'Salary'], 
              outputCols = ["{}_imputed".format(c) for c in ['Age', 'Experience', 'Salary']]
).setStrategy('mean')

In [95]:
imp.fit(df).transform(df).show()             ### imputed null with mean

+---------+----+----------+-------+-----------+------------------+--------------+
|     Name| Age|Experience| Salary|Age_imputed|Experience_imputed|Salary_imputed|
+---------+----+----------+-------+-----------+------------------+--------------+
|    krish|  22|         5| 100000|         22|                 5|        100000|
|     naik|  35|         6| 100006|         35|                 6|        100006|
|    Nupur|  20|         5|     10|         20|                 5|            10|
|     Yash|  34|         6| 566463|         34|                 6|        566463|
|   Shivam|  33|        34|5621238|         33|                34|       5621238|
|Deekshith|  26|        23| 262666|         26|                23|        262666|
|   Rajesh|  32|         2|5565665|         32|                 2|       5565665|
|   Madan |  45|        32|2222222|         45|                32|       2222222|
|  Kuldeep|  43|      NULL| 150000|         43|                18|        150000|
|    Geeta|NULL|        30| 150000|         37|                30|        150000|
|    Shyam|  80|        40|   NULL|         80|                40|       1473827|
+---------+----+----------+-------+-----------+------------------+--------------+

In [97]:
''' imp1 = Imputer( inputCols = ['Age', 'Experience', 'Salary', "Name"], 
              outputCols = ["{}_imputed".format(c) for c in ['Age', 'Experience', 'Salary', "Name"]]
).setStrategy('mean')       

imp1.fit(df).transform(df).show()  '''  ####  just curious as to what happens if I take the mean of name - it gave an error

' imp1 = Imputer( inputCols = [\'Age\', \'Experience\', \'Salary\', "Name"], \n              outputCols = ["{}_imputed".format(c) for c in [\'Age\', \'Experience\', \'Salary\', "Name"]]\n).setStrategy(\'mean\')       \n\nimp1.fit(df).transform(df).show()  '

In [98]:
imp = Imputer( inputCols = ['Age', 'Experience', 'Salary'], 
              outputCols = ["{}_imputed".format(c) for c in ['Age', 'Experience', 'Salary']]
).setStrategy('median')
imp.fit(df).transform(df).show()             ## median instead of mean

+---------+----+----------+-------+-----------+------------------+--------------+
|     Name| Age|Experience| Salary|Age_imputed|Experience_imputed|Salary_imputed|
+---------+----+----------+-------+-----------+------------------+--------------+
|    krish|  22|         5| 100000|         22|                 5|        100000|
|     naik|  35|         6| 100006|         35|                 6|        100006|
|    Nupur|  20|         5|     10|         20|                 5|            10|
|     Yash|  34|         6| 566463|         34|                 6|        566463|
|   Shivam|  33|        34|5621238|         33|                34|       5621238|
|Deekshith|  26|        23| 262666|         26|                23|        262666|
|   Rajesh|  32|         2|5565665|         32|                 2|       5565665|
|   Madan |  45|        32|2222222|         45|                32|       2222222|
|  Kuldeep|  43|      NULL| 150000|         43|                 6|        150000|
|    Geeta|NULL|        30| 150000|         33|                30|        150000|
|    Shyam|  80|        40|   NULL|         80|                40|        150000|
+---------+----+----------+-------+-----------+------------------+--------------+